/*********************************************************
*Copyright (C), 2015, Shanghai Eastsoft Microelectronics Co., Ltd.
*文件名:	spwm.c
*作  者:	XieYF
*版  本:	V1.20
*日  期:	2014/11/25
*描  述:	标准PWM程序
*备  注:    适用于ES7P173x
本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
**********************************************************/
#include <hic.h>

//*****************************************************************************
//                      主程序
//*****************************************************************************
void main()
{
    OSCP = 0x55;      //去除时钟控制写保护  
	OSCC = 0xC0;	  //切换到高速时钟（2MHz）
    while (!SW_HS);	  //等待高速时钟切换完成  
	 
    ANS0 = 0xFF;      //设置为数字端口
    PC3 = 0;		  //PC3端口输出低电平
    PCT3 = 0; 		  //设置PC3端口为输出口    
    T8P1P = 99;		  //设置PWM周期寄存器初值400us
    T8P1RL = 50;	  //设置PWM占空比为50%
    T8P1OC = 0x1; 	  //设置PC3输出PWM
    T8P1C = 0x85;	  //设置T8P1预分频1:4，后分频无效，并启动T8P1
    while(1);
}

    