;/*********************************************************
;*Copyright (C), 2015, Shanghai Eastsoft Microelectronics Co., Ltd.
;*文件名:	pwm.asm
;*作  者:	XieYF
;*版  本:	V1.20
;*日  期:	2014/11/25
;*描  述:	标准PWM程序
;*备  注:   适用于ES7P173x
;本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
;**********************************************************/
#INCLUDE<ES7P173X.INC>

ORG			0x000
GOTO        MAIN
;******************************************************************************
;*                      主程序                                                *
;******************************************************************************
MAIN
    MOVI    0x55
    MOVA    OSCP
    MOVI    0xC0
	MOVA	OSCC			;切换到高速时钟（2MHz）
    JBS		PWEN, SW_HS		;等待高速时钟切换完成
    GOTO    $-1    
    MOVI    0xFF 
    MOVA    ANS0			;设置为数字端口
    BCC     PCT,3			;PWM10输出 
    BSS     T8P1OC,PWM10EN	;使能PWM10输出
    MOVI    0x63			;设置PWM周期寄存器初始值（400us）
    MOVA    T8P1P
    MOVI    0x32			;向占空比寄存器赋初值，占空比50%
    MOVA    T8P1RL
    MOVI    0x85
    MOVA    T8P1C			;T8P1使能，设定预分频1:4，后分频无效,PWM输出模式
    GOTO    $
    END

  
