/*********************************************************
*Copyright (C), 2015, Shanghai Eastsoft Microelectronics Co., Ltd.
*文件名:	t8n.c
*作  者:	XieYF
*版  本:	V1.20
*日  期:	2014/11/25
*描  述:	定时器程序
*备  注:    适用于ES7P173x
本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
**********************************************************/
#include <hic.h>

//*************************************************************************
//                          中断服务程序                                        
//*************************************************************************
void isr(void) interrupt
{
    if(T8NIE&&T8NIF)        //进入T8N定时器中断		
    {					        
        T8NIF = 0;		    //清T8N中断标志
        T8N = T8N+6;		//重载T8N初值，加上进入中断时间
        PB5 = PB5^1;		//输出端口取反
    }
}
//*************************************************************************
//                             主程序
//*************************************************************************
void main()
{
        OSCP = 0x55;		//时钟控制写保护解锁
		OSCC = 0xC0;	    //切换到高速时钟（2MHz）
		while (!SW_HS);	    //等待高速时钟切换完成

        ANS0 = 0xFF;        //设置PB5为数字端口
        PB5 = 0;		    //设置PB5端口输出低电平
        PBT5 = 0; 		    //设置PB5端口为输出口      
        T8NC = 0x07;	    //设置T8N为定时器模式，分频比为1:256 
        T8N = 6;		    //设定时器初值
        T8NPRE = 1;		    //使能预分频器
        T8NIE = 1;		    //使能T8N定时器中断
        GIE = 1;		    //使能全局中断
        T8NEN = 1;		    //打开T8NEN定时器
        while(1);
}
