/*********************************************************
*Copyright (C), 2015, Shanghai Eastsoft Microelectronics Co., Ltd.
*文件名:	keyint.c
*作  者:	XieYF
*版  本:	V1.20
*日  期:	2014/11/25
*描  述:	外部按键中断程序
*备  注:    适用于ES7P173x
本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
**********************************************************/
#include <hic.h>

sbit PA7_tmp; 
void Delay20ms(void);
void isr(void) interrupt
{
	if(KIE && KIF) 
	{
		if(PA7 == 0)
		{
			Delay20ms();		//延时消抖
			if(PA7 == 0)		//再次读取PA7确认按键状态
			{                 
				PB5 = ~PB5;     //处理电平变化中断事件，例如PB5输出取反
			}
		}
		KIF = 0;  				//清除KINT外部按键中断标志
	}

}
//*************************************************************************
//                              主程序                                              
//*************************************************************************
void main()
{
    OSCP = 0x55;
	OSCC = 0xC0;			//切换到高速时钟（2MHz）
    while (!SW_HS);			//等待高速时钟切换完成

    ANS0= 0xFF;				//设置所有的模拟端口为数字端口
    ANS1 = 0XFF;
    N_PAU7 = 0x0;			//使能PA7端口（KIN7）弱上拉
    PAT = 0xFF;				//设置PA端口为输入口
    PBT = 0;				//设置PB端口为输出口

    INTF0 = 0;              //外部按键无电平变化
    INTG = 0x00;			//默认中断模式，中断入口地址0x004
    PA7_tmp = PA7;			//清除中断标志前，对端口操作一次
	KIF = 0;                //清除KIN中断标志
	INTC0 = 0x80;			//使能KIN7（PA7），其余通道关闭				
    INTE0 = 0x01;			//使能KINT中断
    PEIE = 1;
    GIE = 1;				//使能全局中断位
    while(1);
}

//*****************************************************************************
//                               延时子程序                                              
//*****************************************************************************
void Delay20ms(void)
{
    unsigned int Dcount;
    Dcount = 0x0682;  //若设主频2MHz，指令周期1us
    while(Dcount--);  //循环1次12us（含12条指令），计数值计算为20000/12=1666(0x682)
}
