/*********************************************************
*Copyright (C), 2015, Shanghai Eastsoft Microelectronics Co., Ltd.
*文件名:	epwm.c
*作  者:	XieYF
*版  本:	V1.20
*日  期:	2014/11/25
*描  述:	增强型EPWM程序
*备  注:    适用于ES7P173x
本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
**********************************************************/
#include <hic.h>

//*************************************************************************
//                               主程序
//*************************************************************************
void main()
{
    OSCP = 0x55;        //去除时钟控制写保护  
	OSCC = 0xC0;	    //切换到高速时钟（2MHz）
    while (!SW_HS);	    //等待高速时钟切换完成
	             
    ANS0 = 0xFF;        //设置为数字端口
    PC = 0;             //初始化PC端口寄存器为低电平
    PCT = 0; 		    //设置PC端口为输出口   
    T8P2P = 99;			//设置PWM周期寄存器初值400us
    T8P2RL = 50;	    //设置PWM精度寄存器200us
    T8P2OC = 0x3; 		//设置PC1,PC2端口输出PWM
    EPWM2C = 0x40;      //设置为半桥输出
    PDD2C = 0x32;       //设置EPWM死区延时时间50us
    TE2AS = 0; 			//设置TE2关断事件发生后输出端口状态低电平，禁止自动关断
    T8P2C = 0x85;	    //设置T8P2预分频1:4，后分频无效，并启动T8P2
    while(1);
}

    