/*********************************************************
*Copyright (C), 2015, Shanghai Eastsoft Microelectronics Co., Ltd.
*文件名:	adc.c
*作  者:	XieYF
*版  本:	V1.20
*日  期:	2014/11/25
*描  述:	ADC程序
*备  注:    适用于ES7P173x
本软件仅供学习和演示使用，对用户直接引用代码所带来的风险或后果不承担任何法律责任。
**********************************************************/
#include <hic.h>
unsigned int ADCRH_1;    //AD转换结果
unsigned int ADCRH_2;    //AD转换结果

void Delay(void);
//*************************************************************************
//                    主程序
//*************************************************************************
void main()
{
    OSCP = 0x55;        //去除时钟控制写保护  
	OSCC = 0xF0;	    //切换到高速时钟（2MHz）
    while (!SW_HS);	    //等待高速时钟切换完成
	
	PAT = 0xFF;
    ANS0=0;             //模拟通道
    ADCC1=0xE8;			//采样时间8个ADC时钟，时钟选择为Fosc/64，结果低位对齐

    while(1)
    {
        ADCC0=1;	            //使能ADC转换器，选中通道0 
        ADTRG=1;                //触发AD转换
        while( ADTRG);          //等待A/D转换完成
        ADCRH_1=(ADCRH<<8)+ADCRL;//读取AD值
        ADCC0=0x9;	            //使能ADC转换器，选中通道2        
        Delay();                //通道切换延时
		ADTRG=1;                //触发AD转换
        while( ADTRG);          //等待A/D转换完成
        ADCRH_2 =(ADCRH<<8)+ADCRL;//读取AD值
    }
}
//*************************************************************************
//                    延时程序                                             
//*************************************************************************
void Delay(void)
{
    unsigned int Dcount;    	//Delay初值
    Dcount=0x5000;
    while(Dcount--); 
}